{
  "backend/main.mo": "Main actor defining property data types, search criteria, analytics structures, and including storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing map‑autocomplete related features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their functionality across components, pages, hooks, and utilities.",
  "frontend/.env": "Environment file containing the live Google Maps API key and configuration notes for required APIs and billing.",
  "frontend/.env.example": "Template environment file with detailed setup instructions for obtaining and configuring a Google Maps API key.",
  "frontend/GOOGLE_MAPS_SETUP.md": "Documentation explaining how to configure Google Maps API keys, enable APIs, set billing, and apply restrictions.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables and light/dark mode theme definitions.",
  "frontend/index.html": "HTML entry point setting favicon, page title, and loading the main frontend script.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, page navigation, and layout with role-based access.",
  "frontend/src/components/AdminResetControl.tsx": "Admin-only control providing a confirmation dialog to reset all application data to a fresh draft.",
  "frontend/src/components/AgentForm.tsx": "Form component for adding or editing agent profiles with validation and backend mutations.",
  "frontend/src/components/Footer.tsx": "Footer displaying association info and a credit link.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication controls, and user profile display with admin-aware menu items.",
  "frontend/src/components/MapLinkedInsights.tsx": "Generates real-time analytics and charts based on filtered map property data.",
  "frontend/src/components/PropertyMap.tsx": "Large Google Maps component handling markers, clustering, filters, search, radius tools, and heatmaps for property visualization.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities, handling login/logout, and wrapping the app in an auth provider.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, roles, agents, and property-related data using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light and dark theme colors and layout tokens.",
  "frontend/src/main.tsx": "App entry point that initializes React, QueryClient, and the Internet Identity provider before rendering the app.",
  "frontend/src/pages/AgentsPage.tsx": "Admin-only page to list, add, edit, and deactivate agents using query hooks with role-based access control.",
  "frontend/src/pages/Dashboard.tsx": "Fetches agents, properties, and inquiries, computes dashboard stats, and displays summary cards and category counts with loading skeletons.",
  "frontend/src/pages/InquiriesPage.tsx": "Manages inquiry listing, creation, and editing with validation, dialogs, and agent/property selection.",
  "frontend/src/pages/PropertiesPage.tsx": "Handles property listing, map-based filtering, creation and editing forms, and image uploads with previews and validation.",
  "frontend/src/pages/ReportsPage.tsx": "Generates analytics reports including charts, status/category distributions, and map-linked insights using fetched property and inquiry data.",
  "frontend/src/types/google-maps.d.ts": "Provides minimal type declarations for Google Maps objects and marker clustering used by map components.",
  "frontend/src/utils/googlePlaces.ts": "Parses Google Place results into normalized location fields and extracts coordinates and display text.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, clearing, and persisting URL and session parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project state including version info, issues related to Google Maps autocomplete, and a list of feature requirements for map search fixes and admin UI controls."
}