{
  "backend/main.mo": "Main Motoko actor for a real estate platform with property management, access control, blob storage, analytics, and HTTP outcalls; defines Property types (location, category, configuration, furnishing, status) and Analytics types for location-based statistics.",
  "feature_evidence.json": "Feature evidence report documenting four features related to reverting the codebase to Version 54, removing StableDialogContent component, removing mobile keyboard focus handling, and removing DRAFT_STATE.md documentation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx, hooks, components, pages, and configuration files describing authentication, property management, analytics, Google Maps integration, and UI components using standard DialogContent.",
  "frontend/.env": "Environment configuration file containing the Google Maps API key (AIzaSyDKnUstuMMx1v-D90BcGuNSS_YnwJC4ZII) with documentation about required APIs, billing requirements, and security configuration.",
  "frontend/.env.example": "Template environment file with detailed instructions for configuring Google Maps API key, emphasizing mandatory billing requirement, required APIs (Maps JavaScript, Places, Geocoding), security restrictions, and automatic validation features.",
  "frontend/DRAFT_STATE.md": "Empty markdown file (no content).",
  "frontend/GOOGLE_MAPS_SETUP.md": "Comprehensive setup guide for Google Maps API configuration covering prerequisites, API key creation, enabling required APIs (Maps JavaScript, Places, Geocoding), mandatory billing setup with free tier details, security restrictions, and development/production configuration steps.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes, including colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, MAA transparent favicon, and title \"MAA - Mulund Real Estate Agents' Association\" that loads the React app via main.tsx.",
  "frontend/MOBILE_KEYBOARD_FOCUS_QA_CHECKLIST.md": "Empty markdown file (no content).",
  "frontend/src/App.tsx": "Main application component that handles authentication, user profile setup, page routing (dashboard, agents, properties, inquiries, reports), and renders the appropriate page based on login status and user role.",
  "frontend/src/components/AdminResetControl.tsx": "Admin-only component that provides a dangerous reset functionality to delete all application data (agents, properties, inquiries, user profiles) with confirmation dialog requiring 'RESET' text input.",
  "frontend/src/components/AgentForm.tsx": "Dialog form component for adding or editing agent profiles with validation for Principal ID, name, contact info, role selection, and active status toggle.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying MAA branding and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Navigation header with MAA logo, page navigation tabs (filtered by admin role), user avatar with initials, and login/logout button with Internet Identity integration.",
  "frontend/src/components/MapLinkedInsights.tsx": "Analytics dashboard component that displays real-time insights (category distribution, price distribution, location distribution, average price, price range) for properties based on map filters using recharts visualizations.",
  "frontend/src/components/PropertyMap.tsx": "React component that renders an interactive Google Maps interface for displaying properties with markers, clustering, filtering, search autocomplete, radius circles, heatmaps, and draggable markers. Includes a comprehensive filter panel for property attributes and location-based searches.",
  "frontend/src/components/StableDialogContent.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence via AuthClient, and providing authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, agents, properties, inquiries, analytics, and admin functions with automatic cache invalidation and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including primary, secondary, destructive, sidebar, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AgentsPage.tsx": "Admin page component for managing real estate agents with a table view, add/edit/deactivate functionality, role badges, and access control that restricts the page to administrators only.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying key statistics (active agents, properties, inquiries) with category breakdowns and an admin reset control component. Uses cards with icons to show aggregated data from agents, properties, and inquiries queries.",
  "frontend/src/pages/InquiriesPage.tsx": "Inquiry management page with add/edit dialogs, form validation for customer details and contact info, and table display with status filtering. Handles inquiry creation, updates, and agent assignment with validation for required fields.",
  "frontend/src/pages/PropertiesPage.tsx": "Property management page with CRUD operations, image upload (max 10MB), map view with clustering and radius filtering, and real-time search/filter capabilities. Supports both table and map visualization modes with comprehensive property attributes.",
  "frontend/src/pages/ReportsPage.tsx": "Analytics and reporting page displaying charts (bar, line, pie) for property categories, status distribution, inquiry sources, and agent performance. Includes map-linked insights and filtering by category and price range.",
  "frontend/src/types/google-maps.d.ts": "TypeScript type declarations for Google Maps JavaScript API including Map, Marker, InfoWindow, Places, Geocoder, and MarkerClusterer interfaces.",
  "frontend/src/utils/googlePlaces.ts": "Utility functions for parsing Google Places API results into normalized location fields (city, suburb, area, roadName, coordinates) with best-effort matching and fallback logic.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, border radius utilities, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking completed features that reverted the codebase to Version 54 by removing StableDialogContent component, mobile keyboard handling, and related documentation from versions 55-59."
}